#+TITLE: Cubs Season Ticket Log 2018
#+AUTHOR: Allen McPherson

* Data
(Use C-c . to insert date, <RET> to insert new row, then tab through fields)

** STH Ticket Prices
These are the price we paid (as part of our STH package) for each class of tickets.

#+TBLNAME: ticket-classes
| class    | games |  price |
|----------+-------+--------|
| diamond  |     4 | 101.92 |
| marquee  |    19 |  94.08 |
| platinum |    13 |  77.28 |
| gold     |    15 |  63.84 |
| silver   |    21 |  49.28 |
| bronze   |     9 |  28.00 |

** 2018 Schedule

#+TBLNAME: game-schedule
| game-date        | opponent     | class    |  price |
|------------------+--------------+----------+--------|
| <2018-04-09 Mon> | pirates      | diamond  | 101.92 |
| <2018-04-11 Wed> | pirates      | bronze   |  28.00 |
| <2018-04-12 Thu> | pirates      | bronze   |  28.00 |
| <2018-04-13 Fri> | braves       | silver   |  49.28 |
| <2018-04-14 Sat> | braves       | gold     |  63.84 |
| <2018-04-15 Sun> | braves       | silver   |  49.28 |
| <2018-04-16 Mon> | cardinals    | silver   |  49.28 |
| <2018-04-17 Tue> | cardinals    | silver   |  49.28 |
| <2018-04-18 Wed> | cardinals    | silver   |  49.28 |
| <2018-04-26 Thu> | brewers      | bronze   |  28.00 |
| <2018-04-27 Fri> | brewers      | silver   |  49.28 |
| <2018-04-28 Sat> | brewers      | gold     |  63.84 |
| <2018-04-29 Sun> | brewers      | silver   |  49.28 |
| <2018-04-30 Mon> | rockies      | bronze   |  28.00 |
| <2018-05-01 Tue> | rockies      | bronze   |  28.00 |
| <2018-05-02 Wed> | rockies      | bronze   |  28.00 |
| <2018-05-07 Mon> | marlins      | bronze   |  28.00 |
| <2018-05-08 Tue> | marlins      | bronze   |  28.00 |
| <2018-05-09 Wed> | marlins      | bronze   |  28.00 |
| <2018-05-11 Fri> | white sox    | marquee  |  94.08 |
| <2018-05-12 Sat> | white sox    | marquee  |  94.08 |
| <2018-05-13 Sun> | white sox    | marquee  |  94.08 |
| <2018-05-22 Tue> | indians      | gold     |  63.84 |
| <2018-05-23 Wed> | indians      | gold     |  63.84 |
| <2018-05-25 Fri> | giants       | gold     |  63.84 |
| <2018-05-26 Sat> | giants       | platinum |  77.28 |
| <2018-05-27 Sun> | giants       | gold     |  63.84 |
| <2018-06-05 Tue> | phillies     | silver   |  49.28 |
| <2018-06-06 Wed> | phillies     | silver   |  49.28 |
| <2018-06-07 Thu> | phillies     | silver   |  49.28 |
| <2018-06-08 Fri> | pirates      | platinum |  77.28 |
| <2018-06-09 Sat> | pirates      | marquee  |  94.08 |
| <2018-06-10 Sun> | pirates      | platinum |  77.28 |
| <2018-06-18 Mon> | dodgers      | gold     |  63.84 |
| <2018-06-19 Tue> | dodgers      | gold     |  63.84 |
| <2018-06-20 Wed> | dodgers      | platinum |  77.28 |
| <2018-06-29 Fri> | twins        | marquee  |  94.08 |
| <2018-06-30 Sat> | twins        | diamond  | 101.92 |
| <2018-07-01 Sun> | twins        | marquee  |  94.08 |
| <2018-07-03 Tue> | tigers       | marquee  |  94.08 |
| <2018-07-04 Wed> | tigers       | diamond  | 101.92 |
| <2018-07-06 Fri> | reds         | marquee  |  94.08 |
| <2018-07-07 Sat> | reds         | marquee  |  94.08 |
| <2018-07-08 Sun> | reds         | marquee  |  94.08 |
| <2018-07-19 Thu> | cardinals    | marquee  |  94.08 |
| <2018-07-20 Fri> | cardinals    | marquee  |  94.08 |
| <2018-07-21 Sat> | cardinals    | diamond  | 101.92 |
| <2018-07-22 Sun> | cardinals    | marquee  |  94.08 |
| <2018-07-23 Mon> | diamondbacks | platinum |  77.28 |
| <2018-07-24 Tue> | diamondbacks | platinum |  77.28 |
| <2018-07-25 Wed> | diamondbacks | platinum |  77.28 |
| <2018-07-26 Thu> | diamondbacks | platinum |  77.28 |
| <2018-08-02 Thu> | padres       | gold     |  63.84 |
| <2018-08-03 Fri> | padres       | platinum |  77.28 |
| <2018-08-04 Sat> | padres       | marquee  |  94.08 |
| <2018-08-05 Sun> | padres       | platinum |  77.28 |
| <2018-08-10 Fri> | nationals    | marquee  |  94.08 |
| <2018-08-11 Sat> | nationals    | marquee  |  94.08 |
| <2018-08-12 Sun> | nationals    | marquee  |  94.08 |
| <2018-08-14 Tue> | brewers      | gold     |  63.84 |
| <2018-08-15 Wed> | brewers      | gold     |  63.84 |
| <2018-08-23 Thu> | reds         | silver   |  49.28 |
| <2018-08-24 Fri> | reds         | gold     |  63.84 |
| <2018-08-25 Sat> | reds         | platinum |  77.28 |
| <2018-08-26 Sun> | reds         | gold     |  63.84 |
| <2018-08-27 Mon> | mets         | silver   |  49.28 |
| <2018-08-28 Tue> | mets         | silver   |  49.28 |
| <2018-08-29 Wed> | mets         | silver   |  49.28 |
| <2018-09-10 Mon> | brewers      | silver   |  49.28 |
| <2018-09-11 Tue> | brewers      | silver   |  49.28 |
| <2018-09-12 Wed> | brewers      | silver   |  49.28 |
| <2018-09-14 Fri> | reds         | gold     |  63.84 |
| <2018-09-15 Sat> | reds         | platinum |  77.28 |
| <2018-09-16 Sun> | reds         | gold     |  63.84 |
| <2018-09-24 Mon> | pirates      | silver   |  49.28 |
| <2018-09-25 Tue> | pirates      | silver   |  49.28 |
| <2018-09-26 Wed> | pirates      | silver   |  49.28 |
| <2018-09-27 Thu> | pirates      | silver   |  49.28 |
| <2018-09-28 Fri> | cardinals    | platinum |  77.28 |
| <2018-09-29 Sat> | cardinals    | marquee  |  94.08 |
| <2018-09-30 Sun> | cardinals    | marquee  |  94.08 |
#+TBLFM: $4='(org-lookup-first $3 '(remote(ticket-classes,@2$1..@>$1)) '(remote(ticket-classes,@2$3..@>$3)))

** StubHub Listing Data
As of mid-July, StubHub does not provide low/high/suggested prices when listing
tickets. I now use the mobile app to price the tickets. It give a high/low
suggested range (but not a suggested price).


#+TBLNAME: stub-listing
| list-date        | game-date        | N | stub-low | stub-sug | stub-high | initial |
|------------------+------------------+---+----------+----------+-----------+---------|
| <2018-03-25 Sun> | <2018-04-09 Mon> | 2 |   101.00 |   113.00 |    130.00 |  150.00 |
| <2018-03-25 Sun> | <2018-04-11 Wed> | 2 |    19.00 |    19.00 |     21.00 |   21.00 |
| <2018-03-25 Sun> | <2018-04-12 Thu> | 2 |    14.00 |    17.00 |     20.00 |   20.00 |
| <2018-03-25 Sun> | <2018-04-13 Fri> | 2 |    25.00 |    26.00 |     33.00 |   35.00 |
| <2018-03-25 Sun> | <2018-04-14 Sat> | 2 |    56.00 |    57.00 |     75.00 |   80.00 |
| <2018-03-25 Sun> | <2018-04-15 Sun> | 2 |    28.00 |    30.00 |     49.00 |   50.00 |
| <2018-03-25 Sun> | <2018-04-16 Mon> | 2 |    23.00 |    24.00 |     39.00 |   40.00 |
| <2018-03-25 Sun> | <2018-04-17 Tue> | 2 |    20.00 |    23.00 |     25.00 |   25.00 |
| <2018-03-25 Sun> | <2018-04-18 Wed> | 2 |    27.00 |    29.00 |     42.00 |   45.00 |
| <2018-03-25 Sun> | <2018-04-26 Thu> | 2 |    15.00 |    19.00 |     60.00 |   60.00 |
| <2018-03-25 Sun> | <2018-04-27 Fri> | 2 |    29.00 |    33.00 |     47.00 |   50.00 |
| <2018-03-25 Sun> | <2018-04-28 Sat> | 2 |    54.00 |    55.00 |     74.00 |   75.00 |
| <2018-03-25 Sun> | <2018-04-29 Sun> | 2 |    32.00 |    32.00 |     59.00 |   60.00 |
| <2018-03-25 Sun> | <2018-04-30 Mon> | 2 |    14.00 |    15.00 |     24.00 |   25.00 |
| <2018-04-13 Fri> | <2018-05-01 Tue> | 2 |    11.00 |    15.00 |     19.00 |   25.00 |
| <2018-04-13 Fri> | <2018-05-02 Wed> | 2 |    15.00 |    15.00 |     16.00 |   20.00 |
| <2018-04-13 Fri> | <2018-05-07 Mon> | 2 |    15.00 |    16.00 |     18.00 |   25.00 |
| <2018-04-13 Fri> | <2018-05-08 Tue> | 2 |    15.00 |    15.00 |     17.00 |   25.00 |
| <2018-04-13 Fri> | <2018-05-09 Wed> | 2 |    18.00 |    20.00 |     24.00 |   30.00 |
| <2018-04-13 Fri> | <2018-05-11 Fri> | 2 |    95.00 |    98.00 |    109.00 |  120.00 |
| <2018-04-13 Fri> | <2018-05-12 Sat> | 2 |   126.00 |   128.00 |    137.00 |  150.00 |
| <2018-04-13 Fri> | <2018-05-13 Sun> | 2 |   100.00 |   104.00 |    116.00 |  125.00 |
| <2018-04-13 Fri> | <2018-05-22 Tue> | 2 |    44.00 |    45.00 |     62.00 |   65.00 |
| <2018-04-13 Fri> | <2018-05-23 Wed> | 2 |    43.00 |    45.00 |     62.00 |   65.00 |
| <2018-04-13 Fri> | <2018-05-25 Fri> | 2 |    56.00 |    57.00 |     75.00 |   75.00 |
| <2018-04-13 Fri> | <2018-05-26 Sat> | 2 |    73.00 |    75.00 |     85.00 |   95.00 |
| <2018-04-13 Fri> | <2018-05-27 Sun> | 2 |    55.00 |    56.00 |     69.00 |   75.00 |
| <2018-05-03 Thu> | <2018-06-05 Tue> | 2 |    33.00 |    34.00 |     42.00 |   50.00 |
| <2018-05-03 Thu> | <2018-06-06 Wed> | 2 |    32.00 |    34.00 |     39.00 |   45.00 |
| <2018-05-03 Thu> | <2018-06-07 Thu> | 2 |    38.00 |    39.00 |     55.00 |   60.00 |
| <2018-05-03 Thu> | <2018-06-08 Fri> | 2 |    70.00 |    72.00 |     78.00 |   80.00 |
| <2018-05-03 Thu> | <2018-06-09 Sat> | 2 |    91.00 |    93.00 |    105.00 |  120.00 |
| <2018-05-03 Thu> | <2018-06-10 Sun> | 2 |    61.00 |    71.00 |     79.00 |   85.00 |
| <2018-05-03 Thu> | <2018-06-18 Mon> | 2 |    52.00 |    54.00 |     73.00 |   80.00 |
| <2018-05-03 Thu> | <2018-06-19 Tue> | 2 |    48.00 |    52.00 |     63.00 |   70.00 |
| <2018-05-03 Thu> | <2018-06-20 Wed> | 2 |    65.00 |    78.00 |     94.00 |  110.00 |
| <2018-05-03 Thu> | <2018-06-29 Fri> | 2 |    90.00 |    92.00 |     98.00 |  100.00 |
| <2018-05-03 Thu> | <2018-06-30 Sat> | 2 |   112.00 |   116.00 |    124.00 |  130.00 |
| <2018-06-17 Sun> | <2018-07-01 Sun> | 2 |    75.00 |    80.00 |     92.00 |   80.00 |
| <2018-06-17 Sun> | <2018-07-03 Tue> | 2 |    74.00 |    84.00 |    100.00 |   90.00 |
| <2018-06-17 Sun> | <2018-07-04 Wed> | 2 |    85.00 |    89.00 |    105.00 |   95.00 |
| <2018-06-17 Sun> | <2018-07-06 Fri> | 2 |    79.00 |    83.00 |     96.00 |   90.00 |
| <2018-06-17 Sun> | <2018-07-07 Sat> | 2 |    88.00 |    89.00 |     93.00 |   89.00 |
| <2018-06-17 Sun> | <2018-07-08 Sun> | 2 |    56.00 |    65.00 |    100.00 |   80.00 |
| <2018-06-17 Sun> | <2018-07-26 Thu> | 2 |    48.00 |    50.00 |     62.00 |   60.00 |
| <2018-07-18 Wed> | <2018-08-02 Thu> | 2 |    45.00 |    47.00 |     49.00 |   85.00 |
| <2018-07-18 Wed> | <2018-08-03 Fri> | 2 |    72.00 |    76.00 |     78.00 |   95.00 |
| <2018-07-18 Wed> | <2018-08-04 Sat> | 2 |    86.00 |    95.00 |    104.00 |  115.00 |
| <2018-07-18 Wed> | <2018-08-05 Sun> | 2 |    65.00 |    69.00 |     73.00 |   97.00 |
| <2018-07-18 Wed> | <2018-08-10 Fri> | 2 |    89.00 |    92.00 |    105.00 |  130.00 |
| <2018-07-18 Wed> | <2018-08-11 Sat> | 2 |   115.00 |   117.00 |    122.00 |  130.00 |
| <2018-07-18 Wed> | <2018-08-12 Sun> | 2 |    62.00 |    64.00 |     90.00 |  130.00 |
| <2018-07-18 Wed> | <2018-08-14 Tue> | 2 |    49.00 |    50.00 |     57.00 |   85.00 |
| <2018-07-18 Wed> | <2018-08-15 Wed> | 2 |    51.00 |    53.00 |     66.00 |   85.00 |
| <2018-08-18 Sat> | <2018-09-10 Mon> | 2 |    34.00 |          |     77.00 |   80.00 |
| <2018-08-18 Sat> | <2018-09-11 Tue> | 2 |    30.00 |          |     42.00 |   60.00 |
| <2018-08-18 Sat> | <2018-09-12 Wed> | 2 |    29.00 |          |     53.00 |   60.00 |
| <2018-08-18 Sat> | <2018-09-15 Sat> | 2 |    71.00 |          |     98.00 |  100.00 |
| <2018-08-18 Sat> | <2018-09-24 Mon> | 2 |    14.00 |          |     45.00 |   50.00 |
| <2018-08-18 Sat> | <2018-09-25 Tue> | 2 |    19.00 |          |     24.00 |   40.00 |
| <2018-08-18 Sat> | <2018-09-26 Wed> | 2 |    18.00 |          |     40.00 |   50.00 |
| <2018-08-18 Sat> | <2018-09-27 Thu> | 2 |    18.00 |          |     40.00 |   50.00 |
| <2018-08-18 Sat> | <2018-09-28 Fri> | 2 |    66.00 |          |    127.00 |  140.00 |
| <2018-08-18 Sat> | <2018-09-29 Sat> | 2 |    98.00 |          |    122.00 |  140.00 |
| <2018-08-18 Sat> | <2018-09-30 Sun> | 2 |    68.00 |          |     78.00 | 100.00  |



** StubHub Sale Data

#+TBLNAME: stub-sale
| sale-date        | game-date        | sale-price | payout | initial |   delta |
|------------------+------------------+------------+--------+---------+---------|
| <2018-04-08 Sun> | <2018-04-09 Mon> |      30.00 |  27.00 |  150.00 | -123.00 |
| <2018-04-08 Sun> | <2018-04-11 Wed> |      10.00 |   9.00 |   21.00 |  -12.00 |
| <2018-04-09 Mon> | <2018-04-12 Thu> |       8.00 |   7.20 |   20.00 |  -12.80 |
| <2018-03-26 Mon> | <2018-04-13 Fri> |      35.00 |  31.50 |   35.00 |   -3.50 |
| <2018-04-13 Fri> | <2018-04-14 Sat> |      20.00 |  18.00 |   80.00 |  -62.00 |
| <2018-04-14 Sat> | <2018-04-14 Sat> |      20.00 |  18.00 |   80.00 |  -62.00 |
| <2018-04-14 Sat> | <2018-04-15 Sun> |       8.00 |   7.20 |   50.00 |  -42.80 |
| <2018-04-16 Mon> | <2018-04-17 Tue> |      10.00 |   9.00 |   25.00 |  -16.00 |
| <2018-04-13 Fri> | <2018-04-18 Wed> |       9.00 |   8.10 |   45.00 |  -36.90 |
| <2018-04-25 Wed> | <2018-04-26 Thu> |      10.00 |   9.00 |   60.00 |  -51.00 |
| <2018-04-26 Thu> | <2018-04-27 Fri> |      15.00 |  13.50 |   50.00 |  -36.50 |
| <2018-04-25 Wed> | <2018-04-28 Sat> |      25.00 |  22.50 |   75.00 |  -52.50 |
| <2018-04-25 Wed> | <2018-04-29 Sun> |      30.00 |  27.00 |   60.00 |  -33.00 |
| <2018-04-29 Sun> | <2018-05-01 Tue> |      15.00 |  13.50 |   25.00 |  -11.50 |
| <2018-05-01 Tue> | <2018-05-02 Wed> |      10.00 |   9.00 |   20.00 |  -11.00 |
| <2018-05-02 Wed> | <2018-05-07 Mon> |      15.00 |  13.50 |   25.00 |  -11.50 |
| <2018-05-08 Tue> | <2018-05-08 Tue> |      15.00 |  13.50 |   25.00 |  -11.50 |
| <2018-05-04 Fri> | <2018-05-11 Fri> |      80.00 |  72.00 |  120.00 |  -48.00 |
| <2018-05-11 Fri> | <2018-05-12 Sat> |      75.00 |  67.50 |  150.00 |  -82.50 |
| <2018-05-20 Sun> | <2018-05-22 Tue> |      35.00 |  31.50 |   65.00 |  -33.50 |
| <2018-04-15 Sun> | <2018-05-23 Wed> |      50.00 |  45.00 |   65.00 |  -20.00 |
| <2018-05-19 Sat> | <2018-05-25 Fri> |      55.00 |  49.50 |   75.00 |  -25.50 |
| <2018-05-25 Fri> | <2018-05-26 Sat> |      65.00 |  58.50 |   95.00 |  -36.50 |
| <2018-05-10 Thu> | <2018-05-27 Sun> |      60.00 |  54.00 |   75.00 |  -21.00 |
| <2018-05-29 Tue> | <2018-06-05 Tue> |      35.00 |  31.50 |   50.00 |  -18.50 |
| <2018-05-24 Thu> | <2018-06-06 Wed> |      45.00 |  40.50 |   45.00 |   -4.50 |
| <2018-06-07 Thu> | <2018-06-07 Thu> |      20.00 |  18.00 |   60.00 |  -42.00 |
| <2018-06-08 Fri> | <2018-06-08 Fri> |      30.00 |  27.00 |   80.00 |  -53.00 |
| <2018-06-07 Thu> | <2018-06-09 Sat> |      70.00 |  63.00 |  120.00 |  -57.00 |
| <2018-06-04 Mon> | <2018-06-10 Sun> |      55.00 |  49.50 |   85.00 |  -35.50 |
| <2018-06-10 Sun> | <2018-06-18 Mon> |      60.00 |  54.00 |   80.00 |  -26.00 |
| <2018-06-12 Tue> | <2018-06-19 Tue> |      50.00 |  45.00 |   70.00 |  -25.00 |
| <2018-06-14 Thu> | <2018-06-20 Wed> |      60.00 |  54.00 |  110.00 |  -56.00 |
| <2018-06-26 Tue> | <2018-06-29 Fri> |      90.00 |  81.00 |  100.00 |  -19.00 |
| <2018-06-09 Sat> | <2018-06-30 Sat> |     130.00 | 117.00 |  130.00 |  -13.00 |
| <2018-06-24 Sun> | <2018-07-01 Sun> |      90.00 |  81.00 |   80.00 |    1.00 |
| <2018-07-01 Sun> | <2018-07-04 Wed> |      75.00 |  67.50 |   95.00 |  -27.50 |
| <2018-07-01 Sun> | <2018-07-06 Fri> |      75.00 |  67.50 |   90.00 |  -22.50 |
| <2018-06-29 Fri> | <2018-07-07 Sat> |      75.00 |  67.50 |   89.00 |  -21.50 |
| <2018-06-29 Fri> | <2018-07-08 Sun> |      65.00 |  58.50 |   80.00 |  -21.50 |
| <2018-07-24 Tue> | <2018-07-26 Thu> |      40.00 |  36.00 |   60.00 |  -24.00 |
| <2018-08-01 Wed> | <2018-08-02 Thu> |      40.00 |  36.00 |   85.00 |  -49.00 |
| <2018-08-02 Thu> | <2018-08-03 Fri> |      65.00 |  58.50 |   95.00 |  -36.50 |
| <2018-07-31 Tue> | <2018-08-04 Sat> |      80.00 |  72.00 |  115.00 |  -43.00 |
| <2018-08-01 Wed> | <2018-08-05 Sun> |      50.00 |  45.00 |   97.00 |  -52.00 |
| <2018-08-10 Fri> | <2018-08-10 Fri> |      50.00 |  45.00 |  130.00 |  -85.00 |
| <2018-08-10 Fri> | <2018-08-11 Sat> |      80.00 |  72.00 |  130.00 |  -58.00 |
| <2018-08-10 Fri> | <2018-08-12 Sun> |      45.00 |  40.50 |  130.00 |  -89.50 |
| <2018-08-10 Fri> | <2018-08-14 Tue> |      45.00 |  40.50 |   85.00 |  -44.50 |
| <2018-08-10 Fri> | <2018-08-15 Wed> |      45.00 |  40.50 |   85.00 |  -44.50 |
#+TBLFM: $4=$3*.9;%0.2f::$5='(org-lookup-first $2 '(remote(stub-listing,@2$2..@>$2)) '(remote(stub-listing,@2$7..@>$7)))::$6=$4-$5;%0.2f


** Personal Sale Data
Tickets NOT sold on StubHub.

#+TBLNAME: stub-sale
| sale-date        | game-date        | sale-price | payout |
|------------------+------------------+------------+--------|
| <2018-05-11 Fri> | <2018-05-13 Sun> |     100.00 | 100.00 |
| <2018-07-03 Tue> | <2018-07-03 Tue> |      94.00 |  94.00 |
| <2018-09-16 Sun> | <2018-09-16 Sun> |      60.00 |  60.00 |
#+TBLFM: $4=$3;%0.2f


** Personal Use
These are games that we used ourselves (didn't try and sell).

#+TBLNAME: non-stub
| game-date                | used | guests    |   price | note                     |
|--------------------------+------+-----------+---------+--------------------------|
| <2018-04-16 Mon>         | both | bruce, al |   49.28 | actual game on 7/21/2018 |
| <2018-07-19 Thu>         | both | bruce, al |   94.08 |                          |
| <2018-07-20 Fri>         | both | bruce, al |   94.08 |                          |
| <2018-07-21 Sat>         | both | bruce, al |  101.92 |                          |
| <2018-07-22 Sun>         | both | bruce, al |   94.08 | doubleheader             |
| <2018-07-23 Mon>         | both | bruce, al |   77.28 | doubleheader             |
| <2018-07-24 Tue>         | both | bruce, al |   77.28 |                          |
| <2018-07-25 Wed>         | both | bruce, al |   77.28 |                          |
| <2018-07-26 Thu>         | both | bruce, al |   77.28 |                          |
| <2018-08-23 Thu>         | both | bruce, al |   49.28 |                          |
| <2018-08-24 Fri>         | both | bruce, al |   63.84 |                          |
| <2018-08-25 Sat>         | both | bruce, al |   77.28 |                          |
| <2018-08-26 Sun>         | both | bruce, al |   63.84 |                          |
| <2018-08-27 Mon>         | both | bruce, al |   49.28 |                          |
| <2018-08-28 Tue>         | both | bruce, al |   49.28 |                          |
| <2018-08-29 Wed>         | both | bruce, al |   49.28 |                          |
| <2018-09-14 Fri>         | al   | al, gary  |   63.84 | buy extra ticket for jk  |
|--------------------------+------+-----------+---------+--------------------------|
| cost recovery correction |      |           | 1208.48 |                          |
#+TBLFM: $4='(org-lookup-first $1 '(remote(game-schedule,@2$1..@>$1)) '(remote(game-schedule,@2$4..@>$4)))
#+TBLFM: @>$4=vsum(@I..@II);%0.2f


** Cost Recovery
This is how much money we lost!

#+TBLNAME: cost-recovery
| game-date        |  price | sale-price |   delta | running-delta |
|------------------+--------+------------+---------+---------------|
| <2018-04-09 Mon> | 101.92 |      27.00 |  -74.92 |        -74.92 |
| <2018-04-11 Wed> |  28.00 |       9.00 |  -19.00 |        -93.92 |
| <2018-04-12 Thu> |  28.00 |       7.20 |  -20.80 |       -114.72 |
| <2018-04-13 Fri> |  49.28 |      31.50 |  -17.78 |       -132.50 |
| <2018-04-14 Sat> |  63.84 |      18.00 |  -45.84 |       -178.34 |
| <2018-04-15 Sun> |  49.28 |       7.20 |  -42.08 |       -220.42 |
| <2018-04-16 Mon> | -49.28 |       0.00 |   49.28 |       -171.14 |
| <2018-04-17 Tue> |  49.28 |       9.00 |  -40.28 |       -211.42 |
| <2018-04-18 Wed> |  49.28 |       8.10 |  -41.18 |       -252.60 |
| <2018-04-26 Thu> |  28.00 |       9.00 |  -19.00 |       -271.60 |
| <2018-04-27 Fri> |  49.28 |      13.50 |  -35.78 |       -307.38 |
| <2018-04-28 Sat> |  63.84 |      22.50 |  -41.34 |       -348.72 |
| <2018-04-29 Sun> |  49.28 |      27.00 |  -22.28 |       -371.00 |
| <2018-04-30 Mon> |  28.00 |       0.00 |  -28.00 |       -399.00 |
| <2018-05-01 Tue> |  28.00 |      13.50 |  -14.50 |       -413.50 |
| <2018-05-02 Wed> |  28.00 |       9.00 |  -19.00 |       -432.50 |
| <2018-05-07 Mon> |  28.00 |      13.50 |  -14.50 |       -447.00 |
| <2018-05-08 Tue> |  28.00 |      13.50 |  -14.50 |       -461.50 |
| <2018-05-09 Wed> |  28.00 |       0.00 |  -28.00 |       -489.50 |
| <2018-05-11 Fri> |  94.08 |      72.00 |  -22.08 |       -511.58 |
| <2018-05-12 Sat> |  94.08 |      67.50 |  -26.58 |       -538.16 |
| <2018-05-13 Sun> |  94.08 |       0.00 |  -94.08 |       -632.24 |
| <2018-05-22 Tue> |  63.84 |      31.50 |  -32.34 |       -664.58 |
| <2018-05-23 Wed> |  63.84 |      45.00 |  -18.84 |       -683.42 |
| <2018-05-25 Fri> |  63.84 |      49.50 |  -14.34 |       -697.76 |
| <2018-05-26 Sat> |  77.28 |      58.50 |  -18.78 |       -716.54 |
| <2018-05-27 Sun> |  63.84 |      54.00 |   -9.84 |       -726.38 |
| <2018-06-05 Tue> |  49.28 |      31.50 |  -17.78 |       -744.16 |
| <2018-06-06 Wed> |  49.28 |      40.50 |   -8.78 |       -752.94 |
| <2018-06-07 Thu> |  49.28 |      18.00 |  -31.28 |       -784.22 |
| <2018-06-08 Fri> |  77.28 |      27.00 |  -50.28 |       -834.50 |
| <2018-06-09 Sat> |  94.08 |      63.00 |  -31.08 |       -865.58 |
| <2018-06-10 Sun> |  77.28 |      49.50 |  -27.78 |       -893.36 |
| <2018-06-18 Mon> |  63.84 |      54.00 |   -9.84 |       -903.20 |
| <2018-06-19 Tue> |  63.84 |      45.00 |  -18.84 |       -922.04 |
| <2018-06-20 Wed> |  77.28 |      54.00 |  -23.28 |       -945.32 |
| <2018-06-29 Fri> |  94.08 |      81.00 |  -13.08 |       -958.40 |
| <2018-06-30 Sat> | 101.92 |     117.00 |   15.08 |       -943.32 |
| <2018-07-01 Sun> |  94.08 |      81.00 |  -13.08 |       -956.40 |
| <2018-07-03 Tue> |  94.08 |       0.00 |  -94.08 |      -1050.48 |
| <2018-07-04 Wed> | 101.92 |      67.50 |  -34.42 |      -1084.90 |
| <2018-07-06 Fri> |  94.08 |      67.50 |  -26.58 |      -1111.48 |
| <2018-07-07 Sat> |  94.08 |      67.50 |  -26.58 |      -1138.06 |
| <2018-07-08 Sun> |  94.08 |      58.50 |  -35.58 |      -1173.64 |
| <2018-07-19 Thu> | -94.08 |       0.00 |   94.08 |      -1079.56 |
| <2018-07-20 Fri> | -94.08 |       0.00 |   94.08 |       -985.48 |
| <2018-07-21 Sat> | 101.92 |       0.00 | -101.92 |      -1087.40 |
| <2018-07-22 Sun> |  94.08 |       0.00 |  -94.08 |      -1181.48 |
| <2018-07-23 Mon> |  77.28 |       0.00 |  -77.28 |      -1258.76 |
| <2018-07-24 Tue> |  77.28 |       0.00 |  -77.28 |      -1336.04 |
| <2018-07-25 Wed> |  77.28 |       0.00 |  -77.28 |      -1413.32 |
| <2018-07-26 Thu> |  77.28 |      36.00 |  -41.28 |      -1454.60 |
| <2018-08-02 Thu> |  63.84 |      36.00 |  -27.84 |      -1482.44 |
| <2018-08-03 Fri> |  77.28 |      58.50 |  -18.78 |      -1501.22 |
| <2018-08-04 Sat> |  94.08 |      72.00 |  -22.08 |      -1523.30 |
| <2018-08-05 Sun> |  77.28 |      45.00 |  -32.28 |      -1555.58 |
| <2018-08-10 Fri> |  94.08 |      45.00 |  -49.08 |      -1604.66 |
| <2018-08-11 Sat> |  94.08 |      72.00 |  -22.08 |      -1626.74 |
| <2018-08-12 Sun> |  94.08 |      40.50 |  -53.58 |      -1680.32 |
| <2018-08-14 Tue> |  63.84 |      40.50 |  -23.34 |      -1703.66 |
| <2018-08-15 Wed> |  63.84 |      40.50 |  -23.34 |      -1727.00 |
| <2018-08-23 Thu> |  49.28 |       0.00 |  -49.28 |      -1776.28 |
| <2018-08-24 Fri> |  63.84 |       0.00 |  -63.84 |      -1840.12 |
| <2018-08-25 Sat> |  77.28 |       0.00 |  -77.28 |      -1917.40 |
| <2018-08-26 Sun> |  63.84 |       0.00 |  -63.84 |      -1981.24 |
| <2018-08-27 Mon> |  49.28 |       0.00 |  -49.28 |      -2030.52 |
| <2018-08-28 Tue> |  49.28 |       0.00 |  -49.28 |      -2079.80 |
| <2018-08-29 Wed> |  49.28 |       0.00 |  -49.28 |      -2129.08 |
| <2018-09-10 Mon> |  49.28 |       0.00 |  -49.28 |      -2178.36 |
| <2018-09-11 Tue> |  49.28 |       0.00 |  -49.28 |      -2227.64 |
| <2018-09-12 Wed> |  49.28 |       0.00 |  -49.28 |      -2276.92 |
| <2018-09-14 Fri> |  63.84 |       0.00 |  -63.84 |      -2340.76 |
| <2018-09-15 Sat> |  77.28 |       0.00 |  -77.28 |      -2418.04 |
| <2018-09-16 Sun> |  63.84 |       0.00 |  -63.84 |      -2481.88 |
| <2018-09-24 Mon> |  49.28 |       0.00 |  -49.28 |      -2531.16 |
| <2018-09-25 Tue> |  49.28 |       0.00 |  -49.28 |      -2580.44 |
| <2018-09-26 Wed> |  49.28 |       0.00 |  -49.28 |      -2629.72 |
| <2018-09-27 Thu> |  49.28 |       0.00 |  -49.28 |      -2679.00 |
| <2018-09-28 Fri> |  77.28 |       0.00 |  -77.28 |      -2756.28 |
| <2018-09-29 Sat> |  94.08 |       0.00 |  -94.08 |      -2850.36 |
| <2018-09-30 Sun> |  94.08 |       0.00 |  -94.08 |      -2944.44 |
|------------------+--------+------------+---------+---------------|
| total recovery   |        |     #ERROR |  #ERROR |        #ERROR |
#+TBLFM: $2='(org-lookup-first $1 '(remote(game-schedule,@2$1..@>$1)) '(remote(game-schedule,@2$4..@>$4)))
#+TBLFM: $3='(org-lookup-first $1 '(remote(stub-sale,@2$2..@>$2)) '(remote(stub-sale,@2$4..@>$4)))
#+TBLFM: $4=$3-$2;%0.2f::$5=vsum(@I$4..$4);%0.2f
#+TBLFM: @>$5=@II-1 + remote(non-stub,@>$4);%0.2f



#+TBLNAME: cost-recovery
| game-date        |  price | sale-price |  delta | running-delta |
|------------------+--------+------------+--------+---------------|
| <2018-04-09 Mon> | 101.92 |      27.00 | -74.92 |        -74.92 |
| <2018-04-11 Wed> |  28.00 |       9.00 | -19.00 |        -93.92 |
| <2018-04-12 Thu> |  28.00 |       7.20 | -20.80 |       -114.72 |
| <2018-09-29 Sat> |  94.08 |     #ERROR | -94.08 |      -3325.24 |
| <2018-09-30 Sun> |  94.08 |     #ERROR | -94.08 |      -3419.32 |
|------------------+--------+------------+--------+---------------|
| total recovery   |        |            |        |      -2210.84 |
#+TBLFM: $2='(org-lookup-first $1 '(remote(game-schedule,@2$1..@>$1)) '(remote(game-schedule,@2$4..@>$4)))
#+TBLFM: $3='(org-lookup-first $1 '(remote(stub-sale,@2$2..@>$2)) '(remote(stub-sale,@2$4..@>$4)))
#+TBLFM: $4=$3-$2;%0.2f::$5=vsum(@I$4..$4);%0.2f
#+TBLFM: @>$5=@II-1 + remote(non-stub,@>$4);%0.2f
#+TBLFM: $3=if(@@#$$# == #ERROR, 0.00, @@#$$#);

